; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-6-14)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	s13 - location
	p0-2 - location
	p2-1 - location
	p2-6 - location
	p2-12 - location
	p3-0 - location
	p3-5 - location
	p3-10 - location
	p4-5 - location
	p5-13 - location
	p6-4 - location
	p6-7 - location
	p6-8 - location
	p7-6 - location
	p7-11 - location
	p8-0 - location
	p8-1 - location
	p8-5 - location
	p8-9 - location
	p9-1 - location
	p9-4 - location
	p9-5 - location
	p10-4 - location
	p10-9 - location
	p11-7 - location
	p12-0 - location
	p13-3 - location
	)
	(:init
	(at driver1 s6)
	(at driver2 s13)
	(at driver3 s5)
	(at truck1 s0)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s10)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s1)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s3)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s10)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s13)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at package1 s10)
	(at package2 s0)
	(at package3 s13)
	(at package4 s3)
	(at package5 s3)
	(at package6 s8)
	(at package7 s10)
	(at package8 s6)
	(at package9 s7)
	(at package10 s10)
	(at package11 s7)
	(at package12 s8)
	(at package13 s7)
	(at package14 s0)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s2 p2-12)
	(path p2-12 s2)
	(path s12 p2-12)
	(path p2-12 s12)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s3 p3-10)
	(path p3-10 s3)
	(path s10 p3-10)
	(path p3-10 s10)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s5 p5-13)
	(path p5-13 s5)
	(path s13 p5-13)
	(path p5-13 s13)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(path s6 p6-8)
	(path p6-8 s6)
	(path s8 p6-8)
	(path p6-8 s8)
	(path s7 p7-11)
	(path p7-11 s7)
	(path s11 p7-11)
	(path p7-11 s11)
	(path s8 p8-0)
	(path p8-0 s8)
	(path s0 p8-0)
	(path p8-0 s0)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(path s8 p8-5)
	(path p8-5 s8)
	(path s5 p8-5)
	(path p8-5 s5)
	(path s8 p8-9)
	(path p8-9 s8)
	(path s9 p8-9)
	(path p8-9 s9)
	(path s9 p9-1)
	(path p9-1 s9)
	(path s1 p9-1)
	(path p9-1 s1)
	(path s9 p9-4)
	(path p9-4 s9)
	(path s4 p9-4)
	(path p9-4 s4)
	(path s9 p9-5)
	(path p9-5 s9)
	(path s5 p9-5)
	(path p9-5 s5)
	(path s10 p10-4)
	(path p10-4 s10)
	(path s4 p10-4)
	(path p10-4 s4)
	(path s10 p10-9)
	(path p10-9 s10)
	(path s9 p10-9)
	(path p10-9 s9)
	(path s12 p12-0)
	(path p12-0 s12)
	(path s0 p12-0)
	(path p12-0 s0)
	(path s13 p13-3)
	(path p13-3 s13)
	(path s3 p13-3)
	(path p13-3 s3)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 97)
	(= (time-to-drive s8 s0) 97)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 33)
	(= (time-to-drive s3 s1) 33)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 16)
	(= (time-to-drive s4 s1) 16)
	(link s1 s12)
	(link s12 s1)
	(= (time-to-drive s1 s12) 15)
	(= (time-to-drive s12 s1) 15)
	(link s1 s13)
	(link s13 s1)
	(= (time-to-drive s1 s13) 67)
	(= (time-to-drive s13 s1) 67)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 69)
	(= (time-to-drive s4 s2) 69)
	(link s2 s11)
	(link s11 s2)
	(= (time-to-drive s2 s11) 24)
	(= (time-to-drive s11 s2) 24)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 74)
	(= (time-to-drive s6 s3) 74)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 77)
	(= (time-to-drive s0 s4) 77)
	(link s4 s8)
	(link s8 s4)
	(= (time-to-drive s4 s8) 20)
	(= (time-to-drive s8 s4) 20)
	(link s4 s11)
	(link s11 s4)
	(= (time-to-drive s4 s11) 51)
	(= (time-to-drive s11 s4) 51)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 89)
	(= (time-to-drive s3 s5) 89)
	(link s5 s9)
	(link s9 s5)
	(= (time-to-drive s5 s9) 26)
	(= (time-to-drive s9 s5) 26)
	(link s6 s11)
	(link s11 s6)
	(= (time-to-drive s6 s11) 32)
	(= (time-to-drive s11 s6) 32)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 23)
	(= (time-to-drive s1 s7) 23)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 65)
	(= (time-to-drive s2 s7) 65)
	(link s7 s11)
	(link s11 s7)
	(= (time-to-drive s7 s11) 52)
	(= (time-to-drive s11 s7) 52)
	(link s8 s3)
	(link s3 s8)
	(= (time-to-drive s8 s3) 63)
	(= (time-to-drive s3 s8) 63)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 97)
	(= (time-to-drive s5 s8) 97)
	(link s8 s7)
	(link s7 s8)
	(= (time-to-drive s8 s7) 22)
	(= (time-to-drive s7 s8) 22)
	(link s9 s3)
	(link s3 s9)
	(= (time-to-drive s9 s3) 7)
	(= (time-to-drive s3 s9) 7)
	(link s9 s6)
	(link s6 s9)
	(= (time-to-drive s9 s6) 96)
	(= (time-to-drive s6 s9) 96)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 59)
	(= (time-to-drive s8 s9) 59)
	(link s9 s13)
	(link s13 s9)
	(= (time-to-drive s9 s13) 82)
	(= (time-to-drive s13 s9) 82)
	(link s10 s0)
	(link s0 s10)
	(= (time-to-drive s10 s0) 8)
	(= (time-to-drive s0 s10) 8)
	(link s10 s2)
	(link s2 s10)
	(= (time-to-drive s10 s2) 3)
	(= (time-to-drive s2 s10) 3)
	(link s10 s3)
	(link s3 s10)
	(= (time-to-drive s10 s3) 14)
	(= (time-to-drive s3 s10) 14)
	(link s10 s4)
	(link s4 s10)
	(= (time-to-drive s10 s4) 90)
	(= (time-to-drive s4 s10) 90)
	(link s10 s5)
	(link s5 s10)
	(= (time-to-drive s10 s5) 67)
	(= (time-to-drive s5 s10) 67)
	(link s10 s6)
	(link s6 s10)
	(= (time-to-drive s10 s6) 86)
	(= (time-to-drive s6 s10) 86)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 12)
	(= (time-to-drive s7 s10) 12)
	(link s10 s11)
	(link s11 s10)
	(= (time-to-drive s10 s11) 63)
	(= (time-to-drive s11 s10) 63)
	(link s10 s12)
	(link s12 s10)
	(= (time-to-drive s10 s12) 19)
	(= (time-to-drive s12 s10) 19)
	(link s11 s3)
	(link s3 s11)
	(= (time-to-drive s11 s3) 28)
	(= (time-to-drive s3 s11) 28)
	(link s11 s8)
	(link s8 s11)
	(= (time-to-drive s11 s8) 78)
	(= (time-to-drive s8 s11) 78)
	(link s11 s9)
	(link s9 s11)
	(= (time-to-drive s11 s9) 86)
	(= (time-to-drive s9 s11) 86)
	(link s12 s5)
	(link s5 s12)
	(= (time-to-drive s12 s5) 96)
	(= (time-to-drive s5 s12) 96)
	(link s12 s8)
	(link s8 s12)
	(= (time-to-drive s12 s8) 2)
	(= (time-to-drive s8 s12) 2)
	(link s12 s11)
	(link s11 s12)
	(= (time-to-drive s12 s11) 60)
	(= (time-to-drive s11 s12) 60)
	(link s12 s13)
	(link s13 s12)
	(= (time-to-drive s12 s13) 73)
	(= (time-to-drive s13 s12) 73)
	(link s13 s10)
	(link s10 s13)
	(= (time-to-drive s13 s10) 22)
	(= (time-to-drive s10 s13) 22)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s12)
	(at truck1 s8)
	(at truck3 s3)
	(at truck6 s5)
	(at package1 s7)
	(at package2 s13)
	(at package3 s13)
	(at package4 s4)
	(at package5 s4)
	(at package6 s1)
	(at package7 s2)
	(at package8 s5)
	(at package9 s1)
	(at package10 s1)
	(at package11 s11)
	(at package12 s12)
	(at package13 s12)
	))

(:metric minimize (+ (* 1 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (board-truck driver2 truck6 s13)
   deleted: (at driver2 s13) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 1 of 17
2. (drive-truck truck6 s13 s10 driver2)
   deleted: (at truck6 s13)
   added: (at truck6 s10)
   changed: (fuel-used) from 0 to 220
   goals met: 1 of 17
3. (load-truck package1 truck6 s10)
   deleted: (at package1 s10)
   added: (in package1 truck6)
   changed: (load truck6) from 0 to 1, (fuel-per-minute truck6) from 10 to 11
   goals met: 1 of 17
4. (load-truck package7 truck6 s10)
   deleted: (at package7 s10)
   added: (in package7 truck6)
   changed: (load truck6) from 1 to 2, (fuel-per-minute truck6) from 11 to 13
   goals met: 1 of 17
5. (load-truck package10 truck6 s10)
   deleted: (at package10 s10)
   added: (in package10 truck6)
   changed: (load truck6) from 2 to 3, (fuel-per-minute truck6) from 13 to 16
   goals met: 1 of 17
6. (drive-truck truck6 s10 s6 driver2)
   deleted: (at truck6 s10)
   added: (at truck6 s6)
   changed: (fuel-used) from 220 to 1596
   goals met: 1 of 17
7. (load-truck package8 truck6 s6)
   deleted: (at package8 s6)
   added: (in package8 truck6)
   changed: (load truck6) from 3 to 4, (fuel-per-minute truck6) from 16 to 20
   goals met: 1 of 17
8. (drive-truck truck6 s6 s3 driver2)
   deleted: (at truck6 s6)
   added: (at truck6 s3)
   changed: (fuel-used) from 1596 to 3076
   goals met: 1 of 17
9. (load-truck package4 truck6 s3)
   deleted: (at package4 s3)
   added: (in package4 truck6)
   changed: (load truck6) from 4 to 5, (fuel-per-minute truck6) from 20 to 25
   goals met: 1 of 17
10. (load-truck package5 truck6 s3)
   deleted: (at package5 s3)
   added: (in package5 truck6)
   changed: (load truck6) from 5 to 6, (fuel-per-minute truck6) from 25 to 31
   goals met: 1 of 17
11. (drive-truck truck6 s3 s1 driver2)
   deleted: (at truck6 s3)
   added: (at truck6 s1)
   changed: (fuel-used) from 3076 to 4099
   goals met: 1 of 17
12. (unload-truck package10 truck6 s1)
   deleted: (in package10 truck6)
   added: (at package10 s1)
   changed: (load truck6) from 6 to 5, (fuel-per-minute truck6) from 31 to 25
   goals met: 2 of 17
13. (walk driver1 s6 p2-6)
   deleted: (at driver1 s6)
   added: (at driver1 p2-6)
   goals met: 2 of 17
14. (walk driver1 p2-6 s2)
   deleted: (at driver1 p2-6)
   added: (at driver1 s2)
   goals met: 2 of 17
15. (walk driver1 s2 p0-2)
   deleted: (at driver1 s2)
   added: (at driver1 p0-2)
   goals met: 2 of 17
16. (walk driver1 p0-2 s0)
   deleted: (at driver1 p0-2)
   added: (at driver1 s0)
   goals met: 2 of 17
17. (load-truck package2 truck1 s0)
   deleted: (at package2 s0)
   added: (in package2 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 2 of 17
18. (board-truck driver1 truck1 s0)
   deleted: (at driver1 s0) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 2 of 17
19. (drive-truck truck1 s0 s8 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s8)
   changed: (fuel-used) from 4099 to 5166
   goals met: 3 of 17
20. (load-truck package12 truck1 s8)
   deleted: (at package12 s8)
   added: (in package12 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 3 of 17
21. (drive-truck truck6 s1 s7 driver2)
   deleted: (at truck6 s1)
   added: (at truck6 s7)
   changed: (fuel-used) from 5166 to 5741
   goals met: 3 of 17
22. (load-truck package9 truck6 s7)
   deleted: (at package9 s7)
   added: (in package9 truck6)
   changed: (load truck6) from 5 to 6, (fuel-per-minute truck6) from 25 to 31
   goals met: 3 of 17
23. (unload-truck package1 truck6 s7)
   deleted: (in package1 truck6)
   added: (at package1 s7)
   changed: (load truck6) from 6 to 5, (fuel-per-minute truck6) from 31 to 25
   goals met: 4 of 17
24. (load-truck package11 truck6 s7)
   deleted: (at package11 s7)
   added: (in package11 truck6)
   changed: (load truck6) from 5 to 6, (fuel-per-minute truck6) from 25 to 31
   goals met: 4 of 17
25. (drive-truck truck1 s8 s12 driver1)
   deleted: (at truck1 s8)
   added: (at truck1 s12)
   changed: (fuel-used) from 5741 to 5767
   goals met: 3 of 17
26. (unload-truck package12 truck1 s12)
   deleted: (in package12 truck1)
   added: (at package12 s12)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 4 of 17
27. (drive-truck truck1 s12 s13 driver1)
   deleted: (at truck1 s12)
   added: (at truck1 s13)
   changed: (fuel-used) from 5767 to 6570
   goals met: 4 of 17
28. (unload-truck package2 truck1 s13)
   deleted: (in package2 truck1)
   added: (at package2 s13)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 5 of 17
29. (drive-truck truck1 s13 s12 driver1)
   deleted: (at truck1 s13)
   added: (at truck1 s12)
   changed: (fuel-used) from 6570 to 7300
   goals met: 5 of 17
30. (load-truck package13 truck6 s7)
   deleted: (at package13 s7)
   added: (in package13 truck6)
   changed: (load truck6) from 6 to 7, (fuel-per-minute truck6) from 31 to 38
   goals met: 5 of 17
31. (drive-truck truck6 s7 s8 driver2)
   deleted: (at truck6 s7)
   added: (at truck6 s8)
   changed: (fuel-used) from 7300 to 8136
   goals met: 5 of 17
32. (drive-truck truck6 s8 s4 driver2)
   deleted: (at truck6 s8)
   added: (at truck6 s4)
   changed: (fuel-used) from 8136 to 8896
   goals met: 5 of 17
33. (disembark-truck driver1 truck1 s12)
   deleted: (driving driver1 truck1)
   added: (at driver1 s12) (empty truck1)
   goals met: 6 of 17
34. (unload-truck package4 truck6 s4)
   deleted: (in package4 truck6)
   added: (at package4 s4)
   changed: (load truck6) from 7 to 6, (fuel-per-minute truck6) from 38 to 31
   goals met: 7 of 17
35. (unload-truck package5 truck6 s4)
   deleted: (in package5 truck6)
   added: (at package5 s4)
   changed: (load truck6) from 6 to 5, (fuel-per-minute truck6) from 31 to 25
   goals met: 8 of 17
36. (drive-truck truck6 s4 s1 driver2)
   deleted: (at truck6 s4)
   added: (at truck6 s1)
   changed: (fuel-used) from 8896 to 9296
   goals met: 8 of 17
37. (unload-truck package9 truck6 s1)
   deleted: (in package9 truck6)
   added: (at package9 s1)
   changed: (load truck6) from 5 to 4, (fuel-per-minute truck6) from 25 to 20
   goals met: 9 of 17
38. (drive-truck truck6 s1 s12 driver2)
   deleted: (at truck6 s1)
   added: (at truck6 s12)
   changed: (fuel-used) from 9296 to 9596
   goals met: 9 of 17
39. (unload-truck package13 truck6 s12)
   deleted: (in package13 truck6)
   added: (at package13 s12)
   changed: (load truck6) from 4 to 3, (fuel-per-minute truck6) from 20 to 16
   goals met: 10 of 17
40. (drive-truck truck6 s12 s11 driver2)
   deleted: (at truck6 s12)
   added: (at truck6 s11)
   changed: (fuel-used) from 9596 to 10556
   goals met: 10 of 17
41. (unload-truck package11 truck6 s11)
   deleted: (in package11 truck6)
   added: (at package11 s11)
   changed: (load truck6) from 3 to 2, (fuel-per-minute truck6) from 16 to 13
   goals met: 11 of 17
42. (drive-truck truck6 s11 s2 driver2)
   deleted: (at truck6 s11)
   added: (at truck6 s2)
   changed: (fuel-used) from 10556 to 10868
   goals met: 11 of 17
43. (board-truck driver1 truck1 s12)
   deleted: (at driver1 s12) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 10 of 17
44. (unload-truck package7 truck6 s2)
   deleted: (in package7 truck6)
   added: (at package7 s2)
   changed: (load truck6) from 2 to 1, (fuel-per-minute truck6) from 13 to 11
   goals met: 11 of 17
45. (drive-truck truck6 s2 s10 driver2)
   deleted: (at truck6 s2)
   added: (at truck6 s10)
   changed: (fuel-used) from 10868 to 10901
   goals met: 11 of 17
46. (drive-truck truck6 s10 s5 driver2)
   deleted: (at truck6 s10)
   added: (at truck6 s5)
   changed: (fuel-used) from 10901 to 11638
   goals met: 12 of 17
47. (unload-truck package8 truck6 s5)
   deleted: (in package8 truck6)
   added: (at package8 s5)
   changed: (load truck6) from 1 to 0, (fuel-per-minute truck6) from 11 to 10
   goals met: 13 of 17
48. (disembark-truck driver1 truck1 s12)
   deleted: (driving driver1 truck1)
   added: (at driver1 s12) (empty truck1)
   goals met: 14 of 17
49. (drive-truck truck6 s5 s12 driver2)
   deleted: (at truck6 s5)
   added: (at truck6 s12)
   changed: (fuel-used) from 11638 to 12598
   goals met: 13 of 17
50. (board-truck driver1 truck1 s12)
   deleted: (at driver1 s12) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 12 of 17
51. (drive-truck truck1 s12 s8 driver1)
   deleted: (at truck1 s12)
   added: (at truck1 s8)
   changed: (fuel-used) from 12598 to 12618
   goals met: 13 of 17
52. (load-truck package6 truck1 s8)
   deleted: (at package6 s8)
   added: (in package6 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 13 of 17
53. (drive-truck truck1 s8 s12 driver1)
   deleted: (at truck1 s8)
   added: (at truck1 s12)
   changed: (fuel-used) from 12618 to 12640
   goals met: 12 of 17
54. (drive-truck truck1 s12 s1 driver1)
   deleted: (at truck1 s12)
   added: (at truck1 s1)
   changed: (fuel-used) from 12640 to 12805
   goals met: 12 of 17
55. (unload-truck package6 truck1 s1)
   deleted: (in package6 truck1)
   added: (at package6 s1)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 13 of 17
56. (disembark-truck driver1 truck1 s1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s1) (empty truck1)
   goals met: 13 of 17
57. (disembark-truck driver2 truck6 s12)
   deleted: (driving driver2 truck6)
   added: (at driver2 s12) (empty truck6)
   goals met: 13 of 17
58. (board-truck driver1 truck1 s1)
   deleted: (at driver1 s1) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 13 of 17
59. (drive-truck truck1 s1 s12 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s12)
   changed: (fuel-used) from 12805 to 12955
   goals met: 13 of 17
60. (disembark-truck driver1 truck1 s12)
   deleted: (driving driver1 truck1)
   added: (at driver1 s12) (empty truck1)
   goals met: 14 of 17
61. (board-truck driver1 truck6 s12)
   deleted: (at driver1 s12) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 13 of 17
62. (drive-truck truck6 s12 s5 driver1)
   deleted: (at truck6 s12)
   added: (at truck6 s5)
   changed: (fuel-used) from 12955 to 13915
   goals met: 14 of 17
63. (drive-truck truck6 s5 s3 driver1)
   deleted: (at truck6 s5)
   added: (at truck6 s3)
   changed: (fuel-used) from 13915 to 14805
   goals met: 13 of 17
64. (board-truck driver2 truck1 s12)
   deleted: (at driver2 s12) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 13 of 17
65. (drive-truck truck6 s3 s8 driver1)
   deleted: (at truck6 s3)
   added: (at truck6 s8)
   changed: (fuel-used) from 14805 to 15435
   goals met: 13 of 17
66. (drive-truck truck1 s12 s8 driver2)
   deleted: (at truck1 s12)
   added: (at truck1 s8)
   changed: (fuel-used) from 15435 to 15455
   goals met: 14 of 17
67. (disembark-truck driver1 truck6 s8)
   deleted: (driving driver1 truck6)
   added: (at driver1 s8) (empty truck6)
   goals met: 14 of 17
68. (walk driver1 s8 p8-1)
   deleted: (at driver1 s8)
   added: (at driver1 p8-1)
   goals met: 14 of 17
69. (walk driver1 p8-1 s1)
   deleted: (at driver1 p8-1)
   added: (at driver1 s1)
   goals met: 14 of 17
70. (board-truck driver1 truck3 s1)
   deleted: (at driver1 s1) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 14 of 17
71. (disembark-truck driver2 truck1 s8)
   deleted: (driving driver2 truck1)
   added: (at driver2 s8) (empty truck1)
   goals met: 14 of 17
72. (board-truck driver2 truck6 s8)
   deleted: (at driver2 s8) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 14 of 17
73. (drive-truck truck6 s8 s5 driver2)
   deleted: (at truck6 s8)
   added: (at truck6 s5)
   changed: (fuel-used) from 15455 to 16425
   goals met: 15 of 17
74. (drive-truck truck3 s1 s3 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   changed: (fuel-used) from 16425 to 16755
   goals met: 16 of 17
75. (disembark-truck driver1 truck3 s3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s3) (empty truck3)
   goals met: 16 of 17
76. (disembark-truck driver2 truck6 s5)
   deleted: (driving driver2 truck6)
   added: (at driver2 s5) (empty truck6)
   goals met: 16 of 17
77. (walk driver1 s3 p3-0)
   deleted: (at driver1 s3)
   added: (at driver1 p3-0)
   goals met: 16 of 17
78. (walk driver1 p3-0 s0)
   deleted: (at driver1 p3-0)
   added: (at driver1 s0)
   goals met: 16 of 17
79. (walk driver1 s0 p12-0)
   deleted: (at driver1 s0)
   added: (at driver1 p12-0)
   goals met: 16 of 17
80. (walk driver1 p12-0 s12)
   deleted: (at driver1 p12-0)
   added: (at driver1 s12)
   goals met: 17 of 17
